#include <stdio.h>
#include <stdlib.h>
#include <math.h>

void mas() {  //§á§Ö§â§Ó§Ñ§ñ §¡ §á§â§à§Ô§Ñ
	int e, w = 0,*r, q;
	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ
	r = (int*)malloc(q * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	for (int i = 0; i < q; i++) {
		scanf_s("%d", &r[i]);//§ã§Ü§Ñ§ß §é§Ú§ã§Ö§Ý; w- §ã§Ü§à§Ý§î§Ü§à §â§Ñ§Ù §Ù§ß§Ñ§Ü §Þ§Ö§ß§ñ§Ý§ã§ñ; e - §ã §Ü§Ñ§Ü§à§Ô§à §Ù§ß§Ñ§Ü§Ñ §ß§Ñ§é§Ú§ß§Ñ§Ö§ä§ã§ñ §Ú §Ü§Ñ§Ü§à§Û §ã§Ö§Û§é§Ñ§ã §Ù§ß§Ñ§Ü

	}

	for (int i = 0; i < q; i++) {
		if (i == 0)
		{
			if (r[0] >= 0) { e = 1; }
			else { e = -1; }
		}
		else if (((r[i] > 0) && (e == -1)) || ((r[i] < 0) && (e == 1))) {

			w = w + 1; e = -e;
		}
	}
	//printf("\n %d  %d\n", r[i], e);
	printf("\n%d", w);
	exit;
}

void func1b() {  //§Ù§Ñ§Õ§Ñ§ß§Ú§Ö 1 §Ò
	int * r, q , e=0;
	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);
	r = (int*)malloc(q * sizeof(int));  //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	for (int i = 0; i < q; i++) {
		scanf_s("%d", &r[i]);
		//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö
		//w - §á§à§ã§Ý§Ö§Õ§ß§Ö§Ö §Ó§Ó§Ö§Õ§Ö§ß§ß§à§Ö §é§Ú§ã§Ý§à
		//e - §Ü§à§Ý-§Ó§à §â§Ñ§Ù§ß§í§ç §é§Ú§ã§Ö§Ý

	}


	int w = 0;
	for (int i = 0; i < q; i++) {
		if (i == 0) { //§Õ§Ý§ñ §á§Ö§â§Ó§à§Ô§à §é§Ú§ã§Ý§Ñ §Õ§Ö§Ý§Ñ§Ö§Þ §à§ä§Õ§Ö§Ý§î§ß§å§ð §á§â§à§Ó§Ö§â§Ü§å,§é§ä§à§Ò§í §ß§Ñ§Û§ä§Ú w
			w = r[0];
		}
		else if (w == r[i]) {
			e = e - 1;
		}
		e = e + 1;
		w = r[i];
	}
	printf("\n§£§ã§Ö§Ô§à §â§Ñ§Ù§Ý§Ú§é§ß§í§ç §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó %d", e);




}

void mass()// 2 §ß§à§Þ§Ö§â
{
	int q; int* r;
	int e = 1;//§ä,§Ü, §á§Ö§â§Ó§Ñ§ñ §á§â§à§Ó§Ö§â§Ü§Ñ §Ú§Õ§Ö§ä §à§ä§Õ§Ö§Ý§î§ß§à
	int j = 0; //§Þ§Ñ§Ü§ã §ß§Ö§é§Ö§ä§ß§í§ç §é§Ú§ã§Ö§Ý §á§à§Õ§â§ñ§ä §Ú§Õ§å§ë§Ú§ç §Ó§à §Ó§ã§Ö§Û §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à§ã§ä§Ú
	int w = 0;// 1 - §ß§Ö§é§Ö§ä§ß§à§Ö; 2 §é§Ö§ä§ß§à§Ö;

	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ
	r = (int*)malloc(q * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î

	for (int i = 0; i < q; i++) {

		scanf_s("%d", &r[i]);
		//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö
		//w - §é§Ö§ä§ß§à§ã§ä§î §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à §é§Ú§ã§Ý§Ñ
		//e - §Þ§Ñ§Ü§ã §ß§Ö§é§Ö§ä§ß§í§ç §é§Ú§ã§Ö§Ý §á§à§Õ§â§ñ§ä §Ú§Õ§å§ë§Ú§ç §Ó §ä§Ö§Ü§å§ë§Ö§Û §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à§ã§ä§Ú
	}

		//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö
		//w - §é§Ö§ä§ß§à§ã§ä§î §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à §é§Ú§ã§Ý§Ñ
		//e - §Þ§Ñ§Ü§ã §ß§Ö§é§Ö§ä§ß§í§ç §é§Ú§ã§Ö§Ý §á§à§Õ§â§ñ§ä §Ú§Õ§å§ë§Ú§ç §Ó §ä§Ö§Ü§å§ë§Ö§Û §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à§ã§ä§Ú


	for (int i = 0; i < q; i++) {
		if (i == 0) {
			if (r[0] % 2 == 0)
			{
				w = 2;
			}
			else {
				w = 1;
			}
		}
		else if ((r[i] % 2 != 0) && (w == 1))
		{
			e = e + 1;
		}
		else if ((r[i] % 2 == 1) && w == 0)
		{
			e = 1;
		}
		else
		{
			if (e > j)
			{
				j = e;
			}


			e = 1;
			if (w == 1) {  //§Þ§Ö§ß§ñ§Ö§Þ §é§Ö§ä§ß§à§ã§ä§î §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à §é§Ú§ã§Ý§Ñ
				w = w + 1;
			}
			else {
				w = w - 1;
			}
		}
		//printf("\n%d %d\n",e,j); §á§â§à§Ó§Ö§â§ñ§Ý §Õ§Ý§ñ §ã§Ö§Ò§ñ §Ù§ß§Ñ§é §á§Ö§â§Ö§Þ§Ö§ß§ß§í§ç §á§à§ã§Ý§Ö §Ü§Ñ§Ø§Õ§à§Ô§à §ê§Ñ§Ô§Ñ
	}
	if (e > j)
	{
		j = e;
	}
	printf("\n§£§à §Ó§ã§Ö§Û §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à§ã§ä§Ú §Þ§Ñ§Ü§ã. §Õ§Ý§Ú§ß§Ñ §á§à§Õ§â§ñ§ä §Ú§Õ§å§ë§Ú§ç §ß§Ö§é§Ö§ä§ß§í§ç §é§Ú§ã§Ö§Ý §â§Ñ§Ó§ß§Ñ %d", j);
	exit;
}

void asd() {// 3 §ß§à§Þ§Ö§â
	int q, * t;
	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ
	t = (int*)malloc(q * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	for (int i = 0; i < q; i++) {
		scanf_s("%d", &t[i]);
	}

	for (int i = 0; i < q; i++) {
		for (int b = 0; b < i; b++) {
			if (t[b] == t[i] && b != i)
			{
				t[i] = 0;
			}
		}
	}

	for (int i = 1; i < q; i++) {
		for (int m = 1; m < q; m++) {
			if (t[m] != 0 && t[m - 1] == 0)
			{
				t[m - 1] = t[m];
				t[m] = 0;
			}
		}
	}
	for (int i = 0; i < q; i++) { printf("%d  ", t[i]); }
	exit;
}


void massss() {  // 4 §ß§à§Þ§Ö§â
	int* y, q;
	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ
	y = (int*)malloc(q * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î

	for (int i = 0; i < q; i++) {
		scanf_s("%d", &y[i]);
	}



	int w = 0;//§Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§í§Û §ï§Ý§Ý§Ö§Þ§Ö§ß§ä
	int e = 0;// §Ó§ä§à§â§à§Û §ï§Ý§Ý§Ö§Þ§Ö§ß§ä §á§à §â§Ñ§Þ§Ö§â§å §á§à§ã§Ý§Ö §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à§Ô§à
	for (int i = 0; i < q; i++) {
		if (i == 0) {
			w = y[0];
			e = y[0]; //§á§å§ã§ä§î §á§Ö§â§Ó§í§Û §ï§Ý§Ý§Ö§Þ§Ö§ß§ä §Ò§å§Õ§Ö§ä §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§í§Þ
		}
		else if (e == w && y[i] < w) {  //§á§â§à§Ó§Ö§â§Ü§Ñ,§ß§Ñ §ã§Ý§å§é§Ñ§Û,§Ö§ã§Ý§Ú §á§Ö§â§Ó§à§Ö §é§Ú§ã§Ý§à §ß§Ñ§Ú§Ò§à§Ý§î§ê§Ö§Ö
			e = y[i];
		}
		else if (y[i] > w) {  //§Ö§ã§Ý§Ú §é§Ú§ã§Ý§à §ß§Ñ§Ú§Ò§à§Ý§î§ê§Ö§Ö
			e = w;
			w = y[i];


		}
		else if (y[i] > e && y[i] != w) {  // §Ö§ã§Ý§Ú §é§Ú§ã§Ý§à §ß§Ñ§Ú§Ò§à§Ý§î§ê§Ö§Ö §á§à§ã§Ý§Ö §ß§Ñ§Ú§Ò§à§Ý§î§ê§Ö§Ô§à

			e = y[i];

		}
	}
	//printf("\n §³§Ñ§Þ§à§Ö §Ò§à§Ý§î§ê§à§Ö %d, §£§ä§à§â§à§Ö §á§à §å§Ò§í§Ó§Ñ§ß§ß§Ú§ð %d ", w, e);
	q = e;
	printf("§°§ä§Ó§Ö§ä %d", q);
	exit;
}


void bin() {   //§ß§à§Þ§Ö§â 5
	int q, * masbin, find;
	int a = 0, b;

	//	printf(" %d", a);
	//	printf(" %d", b);
	//	printf(" %d", masbin[a]);
	//	printf(" %d", masbin[b]);
	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ 1
	b = q - 1;
	masbin = (int*)malloc(q * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	for (int i = 0; i < q; i++) {
		scanf_s("%d", &masbin[i]);
	}
	printf("\n§Ü§Ñ§Ü§à§Ö §é§Ú§ã§Ý§à §ß§å§Ø§ß§à §ß§Ñ§Û§ä§Ú? ");
	scanf_s("%d", &find);
	while (masbin[a] != masbin[b]) {
		if (masbin[b] == find) {
			a = b;
		}
		else if (find < masbin[(a + b) / 2])
		{
			b = ((a + b) / 2);
		}
		else if (find == masbin[(a + b) / 2])
		{
			a = (a + b) / 2;
			b = a;

		}
		if (find > masbin[(a + b) / 2]) {
			a = (a + b) / 2;

		}


	}

	printf("§£§Ñ§ê§Ö §é§Ú§ã§Ý§à §ß§Ñ %d §Þ§Ö§ã§ä§Ö", a + 1);
	exit;
}
void zadanie6() {  //§á§â§à§Ô§Ñ 6
	int a, s,* mas1,* mas2, * mas3,q,w;

	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &q);//q - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ 1
	mas1 = (int*)malloc(q * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	for (int i = 0; i < q; i++) {
		scanf_s("%d", &mas1[i]);
	}
	printf("\n§£§Ó§Ö§Õ§Ú§ä§Ö §Ü§à§Ý-§Ó§à §é§Ú§ã§Ö§Ý §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	scanf_s("%d", &w);//w - §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Þ§Ñ§ã§ã§Ú§Ó§Ñ 2
	mas2 = (int*)malloc(w * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	for (int i = 0; i < w; i++) {
		scanf_s("%d", &mas2[i]);
	}

	mas3 = (int*)malloc((w + q) * sizeof(int)); //§Ó§í§Õ§Ö§Ý§ñ§Ö§Þ §ß§Ö§à§Ò§ç§à§Õ§Ú§Þ§å§ð §á§Ñ§Þ§ñ§ä§î
	//printf("  §ï§ä§à §ä§Ú§á §Ü§à§Ý-§Ó§à §ï§Ý§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö %d %d\n", q, w);  // §á§â§à§Ó§Ö§â§Ü§Ñ
	for (int i = 0; i < q; i++)
	{
		mas3[i] = mas1[i];
	}
	for (int i = 0; i < w; i++)
	{
		mas3[i + q] = mas2[i];
	}
	for (int i = 0; i < (q + w); i++) { //§á§â§Ú§ß§ä §Ó §Þ§ï§Û§ß§Ö
		printf(" %d ", mas3[i]);
	}

	// for (int i = 0; i < (a + s); i++) {  //§á§â§Ú§ß§ä §á§â§ñ§Þ §Ó §æ§å§ß§Ü§è§Ú§Ú
	// 	printf(" %d ", massiv3[i]);
	// }
	exit;
}
int main()
{
	int q=-1;

	//Task7
	//§©§Ñ§Õ§Ñ§ß§Ú§Ö 1 §¡
	printf("11) (1) - §°§Õ§ß§Ñ §Ú§Ù §Ù§Ñ§Õ§Ñ§é:\n§¥§Ñ§ß §Þ§Ñ§ã§ã§Ú§Ó §ß§Ö§ß§å§Ý§Ö§Ó§í§ç §è§Ö§Ý§í§ç §é§Ú§ã§Ö§Ý.§°§á§â§Ö§Õ§Ö§Ý§Ú§ä§î, §ã§Ü§à§Ý§î§Ü§à §â§Ñ§Ù §ï§Ý§Ö§Þ§Ö§ß§ä§í §Þ§Ñ§ã§ã§Ú§Ó§Ñ §á§â§Ú §á§â§à§ã§Þ§à§ä§â§Ö §à§ä §Ö§Ô§à §ß§Ñ§é§Ñ§Ý§Ñ §Þ§Ö§ß§ñ§ð§ä §Ù§ß§Ñ§Ü.§¯§Ñ§á§â§Ú§Þ§Ö§â, §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö 10, ¨C4, 12, 56, ¨C4, ¨C89 §Ù§ß§Ñ§Ü §Þ§Ö§ß§ñ§Ö§ä§ã§ñ 3 §â§Ñ§Ù§Ñ.\n §£ §Þ§Ñ§ã§ã§Ú§Ó§Ö §Ú§Ù n §ï§Ý§Ö§Þ§Ö§ß§ä§à§Ó §é§Ú§ã§Ý§Ñ §à§Ò§â§Ñ§Ù§å§ð§ä §ß§Ö§å§Ò§í§Ó§Ñ§ð§ë§å§ð §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à§ã§ä§î.§¯§Ö§ã§Ü§à§Ý§î§Ü§à §ï§Ý§Ö§Þ§Ö§ß§ä§à§Ó, §Ú§Õ§å§ë§Ú§ç §á§à§Õ§â§ñ§Õ, §â§Ñ§Ó§ß§í §Þ§Ö§Ø§Õ§å §ã§à§Ò§à§Û.§³§Ü§à§Ý§î§Ü§à §â§Ñ§Ù§Ý§Ú§é§ß§í§ç §é§Ú§ã§Ö§Ý §Ú§Þ§Ö§Ö§ä§ã§ñ §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö ?");
	printf("\n\n12) §£ §Þ§Ñ§ã§ã§Ú§Ó§Ö §Ú§Ù n §ï§Ý§Ö§Þ§Ö§ß§ä§à§Ó §é§Ú§ã§Ý§Ñ §à§Ò§â§Ñ§Ù§å§ð§ä §ß§Ö§å§Ò§í§Ó§Ñ§ð§ë§å§ð §á§à§ã§Ý§Ö§Õ§à§Ó§Ñ§ä§Ö§Ý§î§ß§à§ã§ä§î. §¯§Ö§ã§Ü§à§Ý§î§Ü§à §ï§Ý§Ö§Þ§Ö§ß§ä§à§Ó, §Ú§Õ§å§ë§Ú§ç §á§à§Õ§â§ñ§Õ, §â§Ñ§Ó§ß§í §Þ§Ö§Ø§Õ§å §ã§à§Ò§à§Û. §³§Ü§à§Ý§î§Ü§à §â§Ñ§Ù§Ý§Ú§é§ß§í§ç §é§Ú§ã§Ö§Ý §Ú§Þ§Ö§Ö§ä§ã§ñ §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö? ");
	printf("\n\n2)(2) - §¥§Ñ§ß §Þ§Ñ§ã§ã§Ú§Ó §è§Ö§Ý§í§ç §é§Ú§ã§Ö§Ý. §²§Ñ§ã§ã§Þ§à§ä§â§Ö§ä§î §à§ä§â§Ö§Ù§Ü§Ú §Þ§Ñ§ã§ã§Ú§Ó§Ñ (§Ô§â§å§á§á§í §Ú§Õ§å§ë§Ú§ç §á§à§Õ§â§ñ§Õ §é§Ú§ã§Ö§Ý), §ã§à§ã§ä§à§ñ§ë§Ú§Ö §Ú§Ù §ß§Ö§é§Ö§ä§ß§í§ç §é§Ú§ã§Ö§Ý. §±§à§Ý§å§é§Ú§ä§î §ß§Ñ§Ú§Ò§à§Ý§î§ê§å§ð §Ú§Ù §Õ§Ý§Ú§ß §â§Ñ§ã§ã§Þ§Ñ§ä§â§Ú§Ó§Ñ§Ö§Þ§í§ç §à§ä§â§Ö§Ù§Ü§à§Ó.");
	printf("\n\n3)(2) §µ§Õ§Ñ§Ý§Ú§ä§î §Ú§Ù §Þ§Ñ§ã§ã§Ú§Ó§Ñ §Ó§ã§Ö §á§à§Ó§ä§à§â§ñ§ð§ë§Ú§Ö§ã§ñ §ï§Ý§Ö§Þ§Ö§ß§ä§í, §à§ã§ä§Ñ§Ó§Ú§Ó §Ú§ç §á§Ö§â§Ó§í§Ö §Ó§ç§à§Ø§Õ§Ö§ß§Ú§ñ, §ä. §Ö. §Ó §Þ§Ñ§ã§ã§Ú§Ó§Ö §Õ§à§Ý§Ø§ß§í §à§ã§ä§Ñ§ä§î§ã§ñ §ä§à§Ý§î§Ü§à §â§Ñ§Ù§Ý§Ú§é§ß§í§Ö §ï§Ý§Ö§Þ§Ö§ß§ä§í.( §á§à§Õ §å§Õ§Ñ§Ý§Ö§ß§Ú§Ö§Þ §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ §Þ§Ñ§ã§ã§Ú§Ó§Ñ §ã§Ý§Ö§Õ§å§Ö§ä §á§à§ß§Ú§Þ§Ñ§ä§î:  §Ú§ã§Ü§Ý§ð§é§Ö§ß§Ú§Ö §ï§ä§à§Ô§à §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ §Ú§Ù §Þ§Ñ§ã§ã§Ú§Ó§Ñ §á§å§ä§Ö§Þ §ã§Þ§Ö§ë§Ö§ß§Ú§ñ §Ó§ã§Ö§ç §ã§Ý§Ö§Õ§å§ð§ë§Ú§ç §Ù§Ñ §ß§Ú§Þ §ï§Ý§Ö§Þ§Ö§ß§ä§à§Ó §Ó§Ý§Ö§Ó§à §ß§Ñ 1 §á§à§Ù§Ú§è§Ú§ð;  §á§â§Ú§ã§Ó§à§Ö§ß§Ú§Ö §á§à§ã§Ý§Ö§Õ§ß§Ö§Þ§å §ï§Ý§Ö§Þ§Ö§ß§ä§å §Þ§Ñ§ã§ã§Ú§Ó§Ñ §Ù§ß§Ñ§é§Ö§ß§Ú§ñ 0.)");
	printf("\n\n4)(1) - §¯§Ñ§Û§ä§Ú  §Þ§Ñ§ç2 §Ó §à§Õ§ß§à§Þ§Ö§â§ß§à§Þ §Þ§Ñ§ã§ã§Ú§Ó§Ö.( §ß§Ñ§Ú§Ò§à§Ý§î§ê§Ú§Û §ï§Ý§Ö§Þ§Ö§ß§ä §Þ§Ñ§ã§ã§Ú§Ó§Ñ §á§â§Ú §Ú§ã§Ü§Ý§ð§é§Ö§ß§Ú§Ú §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à§Ô§à §ï§Ý§Ö§Þ§Ö§ß§ä§Ñ §ï§ä§à§Ô§à §Þ§Ñ§ã§ã§Ú§Ó§Ñ; §à§Õ§Ú§ß §á§â§à§ç§à§Õ §á§à §Þ§Ñ§ã§ã§Ú§Ó§å)");
	printf("\n\n5) (2) (§²§Ö§Ü§å§â§ã§Ú§ñ) §¯§Ñ§Û§ä§Ú §Ù§Ñ§Õ§Ñ§ß§ß§í§Û §ï§Ý§Ö§Þ§Ö§ß§ä §Ó §å§á§à§â§ñ§Õ§à§é§Ö§ß§ß§à§Þ §Þ§Ñ§ã§ã§Ú§Ó§Ö (§Ò§Ú§ß§Ñ§â§ß§í§Û §á§à§Ú§ã§Ü)");
	printf("\n\n6) (2) §¯§Ñ§á§Ú§ã§Ñ§ä§î §æ§å§ß§Ü§è§Ú§ð, §à§Ò§ì§Ö§Õ§Ú§ß§ñ§ð§ë§å§ð §Õ§Ó§Ñ §å§á§à§â§ñ§Õ§à§é§Ö§ß§ß§í§ç §Þ§Ñ§ã§ã§Ú§Ó§Ñ §â§Ñ§Ù§Þ§Ö§â§à§Þ m §Ú n §Ó §å§á§à§â§ñ§Õ§à§é§Ö§ß§ß§í§Û §Þ§Ñ§ã§ã§Ú§Ó §â§Ñ§Ù§Þ§Ö§â§à§Þ m+n (§Ú§ä§à§Ô§à§Ó§í§Û §Þ§Ñ§ã§ã§Ú§Ó §ß§Ö §ã§à§â§ä§Ú§â§à§Ó§Ñ§ä§î)");
	printf("\n\n0)§£§í§Û§ä§Ú");
	while (q!=0) {
		printf("\n\n§£§Ó§Ö§Õ§Ú§ä§Ö §ß§à§Þ§Ö§â §ß§å§Ø§ß§à§Ô§à §Ù§Ñ§Õ§Ñ§ß§Ú§ñ : ");
		scanf_s("%d", &q);
		switch(q){
		case 11 :{
				mas();//§©§Ñ§Õ§Ñ§ß§Ú§Ö 1 A
				break;
			};
		case 12: {
			func1b();//§©§Ñ§Õ§Ñ§ß§Ú§Ö 1 §¢
			break;
		}
		case 2: {
			mass();//§Ù§Ñ§Õ§Ñ§ß§Ú§Ö 2
			break;
		}
		case 3: {
			asd();//§©§Ñ§Õ§Ñ§ß§Ú§Ö 3
			break;
		}
		case 4: {
			massss();//§©§Ñ§Õ§Ñ§ß§Ú§Ö 4
			break;
		}
		case 5: {
			bin();//§©§Ñ§Õ§Ñ§ß§Ú§Ö 5
			break;
		}
		case 6: {
			zadanie6();//§©§Ñ§Õ§Ñ§ß§Ú§Ö 6
			break;
		}
		case 0: {
			q = 0;
		}
		}
	}
	return 0;
}
